#include "public.h"


void T0_1ms_init(){
	/*
	设定T0定时器模式 
	M1 = 0, M0 = 1, 工作方式 1, 16 位定时器/计数器
	*/
	TMOD = 0x01;
	
	/*
		设定定时器初值, 使得 1ms 中断一次
		两个 8 位计数器到 2^16 = 65536 会溢出
		机器周期大约为 1us,
		初始值设定为 64536 = 0xFC18 就能 1ms 中断一次(不精确)
	*/
	TH0 = 0xFC;
	TL0 = 0x18;
	
	// 开启定时器0 中断
	ET0 = 1;
	
	// 开启总中断
	EA = 1;
	
	// 开启计时器开关 TR0 
	TR0 = 1;
}

void T0_50ms_init(){
	/*
	设定T0定时器模式 
	M1 = 0, M0 = 1, 工作方式 1, 16 位定时器/计数器
	*/
	TMOD = 0x01;
	
	/*
		设定定时器初值, 使得 100ms 中断一次
		50ms = 50 000 us, 65536 - 50000 = 15536
		两个 8 位计数器到 2^16 = 65536  
		机器周期大约为 1us,
		初始值设定为 15536 = 0x3CB0 就能 50ms 中断一次
	*/
	TH0 = 0x3C;
	TL0 = 0xB0;
	
	// 开启定时器0 中断
	ET0 = 1;
	
	// 开启总中断
	EA = 1;
	
	// 开启计时器开关 TR0 
	TR0 = 1;
}